# ---------------------------------------------------------
# 001 : 문자열 출력하기  [출력]
# https://school.programmers.co.kr/learn/courses/30/lessons/181952
# ---------------------------------------------------------
# 문제:
# 문자열 `str`이 주어질 때, `str`을 출력하는 코드를 작성해 보세요.
# ----------------------------------------
# [제한사항]
# - 1 ≤ `str`의 길이 ≤ 1,000,000
# - `str`에는 공백이 없으며, 첫째 줄에 한 줄로만 주어집니다.
# ----------------------------------------
# [입출력 예]
# 입력 #1
#     HelloWorld!
# 출력 #1
#     HelloWorld!
# ---------------------------------------------------------
# (여기에 내 풀이)
str = input()
print(str)

# 메모:
